import React from 'react';

const extraContent = [
    <>
        <span className="custom-title">Установка на двухсторонний скотч</span>
        <p>Самый быстрый и простой способ монтажа рулонных штор. Он не требует особых навыков или инструментов, что делает его идеальным для людей, которые хотят избежать сверления оконных рам.</p>
        <span className="custom-title">Установка на саморезы</span>
        <p>Кронштейны прикручиваются прямо к оконной раме с помощью саморезов. Это наиболее надежный и долговечный способ установки. Однако он потребует использования дополнительных инструментов.</p>
        <span className="custom-title">Кронштейн на откидную створку</span>
        <p>Этот способ монтажа удобен для окон с откидными створками, поскольку позволяет крепить штору непосредственно на раму створки с возможностью её открывания и закрывания.</p>
    </>,
    <>
        <span className="custom-title">Рулон виден</span>
        <p>Ткань наматывается на вал внутрь, то есть рулон виден. Это обеспечивает прилегание ткани ближе к окну, что способствует лучшему затемнению комнаты и снижению уровня проникновения света.</p>
        <span className="custom-title">Рулон не виден</span>
        <p>Ткань наматывается на вал наружу, то есть рулон скрыт. Это позволяет ткани не прилегать вплотную к окну, что может быть полезно, если на подоконнике расположены предметы, которые не должны касаться шторы.</p>
    </>,
    <>
        {/* Здесь может быть дополнительный контент для следующего шага */}
    </>,
    <>
        <p>• Исключает провисание шторы при откинутой створке, обеспечивая лучшее затемнение комнаты.</p>
        <span className="custom-title">Леска (Установка со сверлением)</span>
        <p>Натягивается по бокам рулонной шторы и крепится к нижнему краю окна на кронштейны, которые устанавливаются на саморезы. Это обеспечивает прилегание полотна шторы к стеклу. Потребуется дополнительный монтаж.</p>
        <span className="custom-title">Магниты (Установка без сверления)</span>
        <p>Магниты крепятся с помощью скотча внизу оконной рамы. Когда штора опускается, магниты автоматически притягиваются к нижнему отвесу, обеспечивая прилегание шторы к окну. Потребуется дополнительный монтаж.</p>
    </>,
    <>
        {/* Здесь может быть дополнительный контент для следующего шага */}
    </>,
    <>
        <span className="custom-title">Груз цепи Стандарт - 0р</span>
        <p>Легкий и функциональный груз предназначен для удержания цепи в натянутом положении. Небольшой вес создает необходимый натяг, предотвращая разбалтывание цепи. Благодаря этому, цепь не улетит в открытое окно.</p>
        <span className="custom-title">Груз цепи Декор +60р</span>
        <p>Более тяжелый и эстетичный груз, также предназначен для удержания цепи в натянутом положении. Создает достаточный натяг, предотвращая разбалтывание цепи. Благодаря этому, цепь не улетит в открытое окно.</p>
        <span className="custom-title">Груз цепи Премиум +250р</span>
        <p>Тяжелый и эстетичный груз, также предназначен для удержания цепи в натянутом положении. Создает достаточный натяг, предотвращая разбалтывание цепи. Благодаря этому, цепь не улетит в открытое окно.</p>
    </>
];

export default extraContent;
